In [1]:
import pandas as pd
import numpy as np

In [9]:
df_excel=pd.read_excel('emp.xlsx')

In [10]:
df_excel

     Name  Age  Salary
0   harsh   35   50000
1  gaurav   40   46000
2   naman   45   36000
3  khushi   35   50000
4   shane   40   46000
5  akhlad   45   36000
6    yash   35   50000
7   kamal   40   46000
8    riya   45   36000
9  ritika   25   32000

In [11]:
df_excel.head()

     Name  Age  Salary
0   harsh   35   50000
1  gaurav   40   46000
2   naman   45   36000
3  khushi   35   50000
4   shane   40   46000

## Pickling
All pandas object are enquipped with to_pickle method which use Python's cPickle module to save data structure to disk using the pickle format.

Pickle is used for serializing and de-serializing Python object structures, also called marshalling or flattening. Serialization refers to the process of converting an object in memory to a byte stream that can be stored on disk or sent over a network

In [16]:
df_excel.to_pickle('df_excel')

In [17]:
df= pd.read_pickle('df_excel')

In [18]:
df.head()

     Name  Age  Salary
0   harsh   35   50000
1  gaurav   40   46000
2   naman   45   36000
3  khushi   35   50000
4   shane   40   46000